**Objetivos**

Este capítulo abordará:
1. Funções.
2. Aplicação de funções em colunas ou linhas de dados.

In [1]:
def my_sq(x):
    """Evela um valor ao quadrado
    """
    return x ** 2

def avg_2(x, y):
    """Calcula a média de 2 números
    """
    return (x + y) / 2

In [2]:
my_sq(4)

16

In [3]:
avg_2(10, 20)

15.0

In [4]:
import pandas as pd

df = pd.DataFrame({"a": [10, 20, 30],
                  "b": [20, 30, 40]})

df

    a   b
0  10  20
1  20  30
2  30  40

In [5]:
df["a"] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [6]:
# aplica nossa função de quadrado na coluna "a"
sq = df["a"].apply(my_sq)
sq

0    100
1    400
2    900
Name: a, dtype: int64

In [7]:
def my_exp(x, e):
    return x ** e

my_exp(2, 3)

8

In [8]:
# usando apply, basta passar o segundo argumento como um argumento nomeado
ex = df["a"].apply(my_exp, e = 2)
ex

0    100
1    400
2    900
Name: a, dtype: int64

In [9]:
ex = df["a"].apply(my_exp, e = 3)
ex

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [10]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [11]:
def print_me(x):
    print(x)
    
# operações em colunas (axis = 0)
df.apply(print_me, axis = 0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [12]:
# operações em linhas (axis = 1)
df.apply(print_me, axis = 1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [13]:
# apply (mais avançado)
import seaborn as sns

titanic = sns.load_dataset("titanic")

titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [14]:
import numpy as np

# número de valores ausentes
def count_missing(vec):
    """Conta o número de valores ausentes em um vetor
    """
    # obtém um vetor com valores True/False,
    # conforme o valor esteja ausente ou não
    null_vec = pd.isnull(vec)
    
    # obtém a soma de null_vec
    # pois valores null não contribuem com a soma
    null_count = np.sum(null_vec)
    
    # devolve o número de valores ausentes no vetor
    return null_count

In [15]:
# proporção de valores ausentes
def prop_missing(vec):
    """Porcentagem de valores ausentes em um vetor
    """
    # numerador: número de valores ausentes
    # podemos usar a função count_missing que acabamos de escrever!
    num = count_missing(vec)
    
    # denominador: número total de valores no vetor
    # precisamos contabilizar também os valores ausentes
    dem = vec.size
    
    # devolve a proporção/porcentagem de valores ausentes
    return num / dem

In [16]:
# proporção de valores completos
def prop_complete(vec):
    """Porcentagem de valores não ausentes em um vetor
    """
    # podemos usar a função prop_missing que acabamos de escrever 
    # subtraindo seu valor de 1
    return 1 - prop_missing(vec)

In [17]:
# operações em colunas
cmis_col = titanic.apply(count_missing)
cmis_col

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [18]:
pmis_col = titanic.apply(prop_missing)
pmis_col

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [19]:
pcom_col = titanic.apply(prop_complete)
pcom_col

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [20]:
print(titanic.loc[pd.isnull(titanic["embark_town"]), :])

     survived  pclass     sex   age  sibsp  parch  fare embarked  class  \
61          1       1  female  38.0      0      0  80.0      NaN  First
829         1       1  female  62.0      0      0  80.0      NaN  First

       who  adult_male deck embark_town alive  alone
61   woman       False    B         NaN   yes   True
829  woman       False    B         NaN   yes   True

In [21]:
# operações em linhas
cmis_row = titanic.apply(count_missing, axis = 1)
cmis_row

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [22]:
pmis_row = titanic.apply(prop_missing, axis = 1)
pmis_row

0      0.066667
1      0.000000
2      0.066667
3      0.000000
4      0.066667
         ...
886    0.066667
887    0.000000
888    0.133333
889    0.000000
890    0.066667
Length: 891, dtype: float64

In [24]:
pcom_row = titanic.apply(prop_complete, axis = 1)
pcom_row

0      0.933333
1      1.000000
2      0.933333
3      1.000000
4      0.933333
         ...
886    0.933333
887    1.000000
888    0.866667
889    1.000000
890    0.933333
Length: 891, dtype: float64

In [25]:
# há uma linha com vários valores ausentes?
print(cmis_row.value_counts())

1    549
0    182
2    160
dtype: int64

In [26]:
titanic["num_missing"] = titanic.apply(count_missing, axis = 1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1

In [27]:
# amostrando aleatoriamente linhas com > 1 missing
print(titanic.loc[titanic.num_missing > 1, :].sample(10))

     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
692         1       3    male  NaN      0      0  56.4958        S   Third
32          1       3  female  NaN      0      0   7.7500        Q   Third
101         0       3    male  NaN      0      0   7.8958        S   Third
598         0       3    male  NaN      0      0   7.2250        C   Third
464         0       3    male  NaN      0      0   8.0500        S   Third
547         1       2    male  NaN      0      0  13.8625        C  Second
524         0       3    male  NaN      0      0   7.2292        C   Third
466         0       2    male  NaN      0      0   0.0000        S  Second
485         0       3  female  NaN      3      1  25.4667        S   Third
656         0       3    male  NaN      0      0   7.8958        S   Third

       who  adult_male deck  embark_town alive  alone  num_missing
692    man        True  NaN  Southampton   yes   True            2
32   woman       False  NaN   Queenstown   yes   True            2
101    man        True  NaN  Southampton    no   True            2
598    man        True  NaN    Cherbourg    no   True            2
464    man        True  NaN  Southampton    no   True            2
547    man        True  NaN    Cherbourg   yes   True            2
524    man        True  NaN    Cherbourg    no   True            2
466    man        True  NaN  Southampton    no   True            2
485  woman       False  NaN  Southampton    no  False            2
656    man        True  NaN  Southampton    no   True            2